package Library_Service;

public class Run {
	/*
	 * 책에는 작가, 도서명, 출판사, 장르, 책 권수, 책 번호로 되어있다.
	 * 책 내용 출력 기능을 가지고 있다.
	 * 
	 * 사용자에는 이름이 있는 이름, 성별, 빌린 책 권수있다.
	 * 사용자는 책을 빌릴 수 있고 찾을 수 있고, 반납할 수 있다.
	 * 책을 빌리면 도서관에 있는 책 권수가 줄어들게 되고 만약 0권일 시 더 이상 책을 빌릴 수 없다고 한다.
	 * 책을 찾을 때는 제목으로 찾기, 작가 이름으로 찾기, 장르로 찾기, 책 번호로 찾기로 한다.
	 * 제목을 입력하면 책에 대한 정보를 출력하게 하고 빌리겠습니까?를 하게 해준다.
	 * 작가 이름을 입력하면 작가가 만든 책을 쭉 나열시키고 빌리겠습니까? 하면 y를 누르고 번호를 입력하면 빌리게 해준다.
	 * 장르로 찾기로 하면 책 나열을 해주고 원
	 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
